Revit 2024 API
SiteLocation.IsCompatibleWith Method
 Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsCompatibleWith(
	SiteLocation otherSiteLocation
)
Visual Basic
Public Function IsCompatibleWith ( _
	otherSiteLocation As SiteLocation _
) As Boolean
Visual C++
public:
bool IsCompatibleWith(
	SiteLocation^ otherSiteLocation
)
Parameters
otherSiteLocation
Type: Autodesk.Revit.DB.SiteLocation
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace